let conjunctions = [
    'و', 'یا', 'پس', 'اگر', 'نه', 'را','چون', 'چه',
    'تا', 'اما','باری', 'خواه','زیرا', 'که', 'لیکن',
    'نیز', 'در', 'ولی','هم', 'چون که','چونکه', 'چندان که','چندانکه', 'زیرا که','زیراکه', 'همینکه',
    'همین که', 'همان که','بلکه', 'چنانچه','چنانکه', 'تا اینکه', 'تا این که','تا آنکه', 'تاآنکه','آن', 'ان',
    'آنجا', 'آن جا','ان', 'ان جا','به', 'هرجا', 'اینجا', 'این', 'اینها', 'آنها', 'روی', 'من','تو','ما', 'شما', 'آنها','بر',
]
let s = 'سلام من و تو'
conjunctions.map((val)=>{
    s = s.replace(' '+val+' ', ' ' );
})
console.log(s);